       IDENTIFICATION DIVISION.
       PROGRAM-ID. INITFILES.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUSTOMER-FILE ASSIGN TO '../DATA/CUSTOMERS.DAT'
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS CUSTOMER-ID
               ALTERNATE RECORD KEY IS CUSTOMER-NAME WITH DUPLICATES.
           SELECT BOOKING-FILE ASSIGN TO '../DATA/BOOKINGS.DAT'
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS BOOKING-ID
               ALTERNATE RECORD KEY IS CHECKIN-DATE WITH DUPLICATES
               ALTERNATE RECORD KEY IS CHECKOUT-DATE WITH DUPLICATES.
       DATA DIVISION.

       FILE SECTION.
       FD  CUSTOMER-FILE.
       COPY "./CopyBooks/CUSTOMERS.cpy".

       FD  BOOKING-FILE.
       COPY "./CopyBooks/BOOKINGS.cpy".

       WORKING-STORAGE SECTION.
       01 WS-DUMMY-VALUE     PIC X VALUE ' '.
       01  WS-FILE-STATUS    PIC 99.
       PROCEDURE DIVISION.
       BEGIN.
           OPEN OUTPUT CUSTOMER-FILE
           OPEN OUTPUT BOOKING-FILE

           *> Optionally write a dummy record, or just close to create empty files
           CLOSE CUSTOMER-FILE
           CLOSE BOOKING-FILE

           DISPLAY "Files initialized."
           STOP RUN.
