       01  BOOKING-RECORD.
           05 BOOKING-ID      PIC 9(5).
           05 ROOM-ID-BK      PIC X(5).
           05 CUSTOMER-ID-BK  PIC 9(5).
           05 CHECKIN-DATE    PIC 9(8).
           05 CHECKOUT-DATE   PIC 9(8).
           05 BOOKING-STATUS  PIC X(10).
           05 CHEKIN-FLAG     PIC X VALUE 'N'.
           05 CHECKOUT-FLAG   PIC X VALUE 'N'.
           05 CREATED-AT      PIC X(14).
