       01  BOOKING-RECORD.
           05 BOOKING-ID        PIC 9(5).
           05 ROOM-ID-BK        PIC X(5).
           05 CUSTOMER-NAME-BK  PIC X(20).
           05 CUSTOMER-PH-BK    PIC X(15).
           05 CHECKIN-DATE      PIC 9(8).
           05 BOOKING-STATUS    PIC X(10).
           05 CREATED-AT        PIC X(8).
