       01 CHECKINOUT-RECORD.
           05 CHECKIN-ID            PIC 9(5).
           05 BOOKING-ID            PIC 9(5).
           05 ROOM-ID               PIC X(5).
           05 ACTUAL-CHEKIN-DT      PIC 9(14).
           05 ACTUAL-CHECKOUT-DT    PIC 9(14).
