       01  CUSTOMER-RECORD.
           05 CUSTOMER-ID     PIC 9(5).
           05 CHECKIN-ID      PIC 9(5).
           05 CUSTOMER-NAME   PIC X(20).
           05 CUSTOMER-AGE    PIC 9(3).
           05 CUSTOMER-GENDER PIC X(5).
           05 CUSTOMER-PH  PIC X(15).
           05 NRC-NUMBER      PIC X(25).
