       01  GUEST-RECORD.
           05 GUEST-ID     PIC 9(5).
           05 GUEST-NAME   PIC X(20).
           05 GUEST-AGE    PIC 9(3).
           05 GUEST-NRC    PIC X(18).
           05 GUEST-GENDER PIC X(1).
