       01  INVOICE-RECORD.
           05 INVOICE-ID         PIC 9(5).
           05 BOOKING-ID-IV      PIC 9(5).
           05 ROOM-CHARGE        PIC 9(9).
           05 SERVICE-CHARGE     PIC 9(9).
           05 TAX-RATE           PIC 9(2).
           05 TOTAL-CHARGE       PIC 9(9).
           05 CREATED-AT-IV      PIC 9(8).
