       01  ROOMS-RECORD.
           05  ROOM-ID             PIC X(5).
           05  ROOM-TYPE           PIC X(10).
           05  PRICE-PER-NIGHT     PIC 9(9).
           05  R-STATUS            PIC X(10).
           05  ACTIVE-BOOKING-COUNT PIC 9(3).
