       01 STAYLOG-RECORD.
           05 STAYLOG-ID           PIC 9(5).
           05 CUSTOMER-ID-SL       PIC 9(5).
           05 CHECKIN-ID-SL        PIC 9(5).
           05 BOOKING-ID-SL        PIC 9(5).
           05 ROOM-ID-SL           PIC X(5).
